Revit 2027 API
Checker.CheckerColor2 Property
 The property labeled "Color 2" from the "Checker" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string CheckerColor2 { get; }
Public Shared ReadOnly Property CheckerColor2 As String
	Get
public:
static property String^ CheckerColor2 {
	String^ get ();
}
static member CheckerColor2 : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.
See Also
Reference
Checker Class
Autodesk.Revit.DB.Visual Namespace